import React from "react";

const About = ({}) => {
	return (
		<section className="about container">
			<h2 className="home-section__title">Наши преимущества</h2>
			<div className="about__items">
				<article className="about__item">
					<svg className="about__svg" viewBox="0 0 60 49.0187" fill="none">
						<path
							d="M5.27 49.01h49.45c2.91 0 5.28-2.35 5.28-5.25V5.25C60 2.35 57.63 0 54.72 0H5.27C2.36 0 0 2.35 0 5.25v38.51c0 2.9 2.36 5.25 5.27 5.25ZM3.51 5.25c0-.97.79-1.75 1.76-1.75h49.45c.97 0 1.76.78 1.76 1.75v38.51c0 .97-.79 1.75-1.76 1.75H5.27c-.97 0-1.76-.78-1.76-1.75V5.25Z"
							fill="#01E45C"
						/>
						<path
							d="M8.78 38.51h2.18a5.28 5.28 0 0 0 9.94 0h30.31c.97 0 1.75-.78 1.75-1.75s-.78-1.75-1.75-1.75H20.9a5.28 5.28 0 0 0-9.94 0H8.78c-.97 0-1.75.78-1.75 1.75s.78 1.75 1.75 1.75Zm7.15-3.5c.97 0 1.76.78 1.76 1.75a1.76 1.76 0 0 1-3.52 0c0-.97.79-1.75 1.76-1.75ZM22.04 27.74c.52.32 1.17.35 1.71.08l14.06-7c.6-.3.97-.9.97-1.57 0-.66-.37-1.27-.97-1.56l-14.06-7.01c-.54-.27-1.19-.24-1.71.08s-.83.88-.83 1.49v14.01c0 .6.31 1.17.83 1.48Zm2.68-12.66 8.38 4.17-8.38 4.17v-8.34Z"
							fill="#2B2B2B"
						/>
					</svg>
					<h3 className="about__item__title">
						Большой выбор
						<br />
						онлайн-курсов
					</h3>
					<p className="about__item__text">
						Мы аккумулируем большое количество онлайн-курсов по различным
						направлениям, позволяя сравнивать их, и выбирать то, что вам
						нравится
					</p>
				</article>
				<article className="about__item">
					<svg className="about__svg" viewBox="0 0 66.197 49.396" fill="none">
						<path
							d="M64.42 39 49.61 24.18c2.78-6.32 1.59-13.97-3.57-19.14-6.72-6.73-17.59-6.73-24.31 0-6.7 6.72-6.7 17.64 0 24.35 5.33 5.34 13.13 6.35 19.36 3.47l14.73 14.75a6.072 6.072 0 0 0 8.6 0 6.12 6.12 0 0 0 0-8.61ZM24.47 26.65c-5.19-5.2-5.19-13.66 0-18.86 5.2-5.21 13.63-5.21 18.83 0 5.19 5.2 5.19 13.66 0 18.86-5.2 5.21-13.62 5.21-18.83 0Zm37.2 18.21c-.86.86-2.25.86-3.1 0L44.49 30.77c1.16-.91 2.19-1.96 3.09-3.14l14.09 14.12c.86.86.86 2.25 0 3.11Z"
							fill="#01E45C"
						/>
						<path
							d="M1.93 23.26h8.28c1.07 0 1.93-.87 1.93-1.94 0-1.07-.86-1.94-1.93-1.94H1.93c-1.07 0-1.93.87-1.93 1.94 0 1.07.86 1.94 1.93 1.94ZM1.93 31.55h11.38c1.07 0 1.94-.87 1.94-1.94 0-1.08-.87-1.94-1.94-1.94H1.93c-1.07 0-1.93.86-1.93 1.94 0 1.07.86 1.94 1.93 1.94ZM1.93 39.83h19.65c1.07 0 1.94-.87 1.94-1.94 0-1.07-.87-1.94-1.94-1.94H1.93c-1.07 0-1.93.87-1.93 1.94 0 1.07.86 1.94 1.93 1.94ZM44.32 44.24H1.93c-1.07 0-1.93.87-1.93 1.94 0 1.07.86 1.94 1.93 1.94h42.39c1.07 0 1.94-.87 1.94-1.94 0-1.07-.87-1.94-1.94-1.94Z"
							fill="#2B2B2B"
						/>
					</svg>
					<h3 className="about__item__title">
						Актуальная <br />
						информация
					</h3>
					<p className="about__item__text">
						Мы регулярно обновляем наши базы данных, чтобы предоставлять вам
						только самую свежую информацию о новых курсах, старте обучения,
						скидках и предложениях от онлайн-школ
					</p>
				</article>
				<article className="about__item">
					<svg className="about__svg" viewBox="0 0 53.261 50" fill="none">
						<defs>
							<clipPath id="a">
								<rect
									rx="0"
									width="52.261"
									height="49"
									transform="translate(.5 .5)"
									fill="#fff"
									fillOpacity="0"
								/>
							</clipPath>
						</defs>
						<rect
							rx="0"
							width="52.261"
							height="49"
							transform="translate(.5 .5)"
							fill="none"
						/>
						<g clip-path="url(#a)">
							<path
								d="M4.41 1.9v2.36C2.19 5.04.6 7.16.6 9.64s1.59 4.59 3.81 5.38v32.8a1.9 1.9 0 1 0 3.8 0v-32.8c2.22-.79 3.81-2.9 3.81-5.38s-1.59-4.6-3.81-5.38V1.9a1.9 1.9 0 1 0-3.8 0Zm3.8 7.74a1.9 1.9 0 1 1-3.8 0c0-1.05.85-1.91 1.9-1.91 1.05 0 1.9.86 1.9 1.91Z"
								fill="#2B2B2B"
							/>
							<path
								d="M24.79 47.82v-2.36a5.708 5.708 0 0 1-3.81-5.38c0-2.48 1.59-4.59 3.81-5.38V1.9c0-1.05.85-1.91 1.9-1.91 1.05 0 1.9.86 1.9 1.91v32.8c2.22.79 3.81 2.9 3.81 5.38s-1.59 4.6-3.81 5.38v2.36a1.9 1.9 0 1 1-3.8 0Zm3.8-7.74a1.9 1.9 0 1 0-3.8 0c0 1.05.85 1.91 1.9 1.91 1.05 0 1.9-.86 1.9-1.91Z"
								fill="#01E45C"
							/>
							<path
								d="M45.17 1.9v2.36c-2.22.78-3.81 2.9-3.81 5.38s1.59 4.59 3.81 5.38v32.8a1.9 1.9 0 1 0 3.8 0v-32.8c2.22-.79 3.81-2.9 3.81-5.38s-1.59-4.6-3.81-5.38V1.9a1.9 1.9 0 1 0-3.8 0Zm3.8 7.74a1.9 1.9 0 1 1-3.8 0c0-1.05.85-1.91 1.9-1.91 1.05 0 1.9.86 1.9 1.91Z"
								fill="#2B2B2B"
							/>
						</g>
					</svg>
					<h3 className="about__item__title">
						Скорость <br />
						поиска
					</h3>
					<p className="about__item__text">
						Агрегатор курсов создан для экономии вашего времени. Вы можете с
						легкостью найти подходящий курс в нашем каталоге по различным
						фильтрам
					</p>
				</article>
			</div>
		</section>
	);
};

export default About;
